'''
level 1

1) Пользователь вводит число a и число b. Возвести а в степень b
2) Пользователь вводит число от 1 до 7. Вывести соответствующий день недели
3) Пользователь вводит 2 числа. Вывести наибольшее из них
4) Пользователь вводит свой депозит и хороший курс доллара. Вывести в консоль депо в рублях и заплакать
'''

try:
    a, b = int(input('введите первое число: ')), int(input('введите второе число: '))
    print(a ** b)
except ValueError:
    print("пожалуйста, вводите только числовые значения")

try:
    a = int(input('введите число от 1 до 7: '))
    while a > 7 or a == 0:
        a = int(input('введите число от 1 до 7: '))
    day = ['понедельник','вторник','среда','четверг','пятница','суббота','воскресенье']
    print('выбранный день:', day[a-1])
except ValueError:
    print('вы ввели не целое число или букву')

try:
    a = int(input('введите первое число: '))
    b = int(input('введите второе число: '))
    if a > b:
        print('наибольшее число:', a)
    else:
        print('наибольшее число:', b)
except ValueError:
    print('вы ввели не целое число или букву')

try:
    a = float(input('введите свой депозит: '))
    b = float(input('введите курс доллара: '))
    print(a*b,'рублей')
except ValueError:
    print('вы ввели букву или символ')

'''
level 2

1) Пользователь вводит число. Если оно четное, вывести "четное". Если оно нечетное, вывести "нечетное"
2) Пользователь вводит 3 числа. Вывести наименьшее из них
3) Из нарнийского чата Аня узнала, что рекомендуется спать хотя бы A часов в сутки, но пересыпать тоже вредно и не
стоит спать более B часов. Сейчас Аня спит H часов в сутки. Если режим сна Ани удовлетворяет рекомендациям Сергея,
выведите “Это нормально”. Если Аня спит менее A часов, выведите “Недосып”, если же более B часов, то выведите “Пересып”.
Получаемое число A всегда меньше либо равно B (то есть это проверять не надо).
'''

try:
    a = int(input('введите число: '))
    if (a % 2) == 1:
        print('нечетное')
    else:
        print('четное')
except ValueError:
    print('вы ввели не целое число или символ')

try:
    a, b, c = int(input('введите первое число: ')), int(input('введите второе число: ')), int(input('введите третье число: '))
    all = [a, b, c]
    print(min(all))
except ValueError:
    print('вы ввели не целое число или символ')

try:
    a = int(input('введите сколько минимум рекомендуется спать: '))
    b = int(input('введите сколько нельзя пересыпать: '))
    h = int(input('введите сколько спит человек: '))
    if (a <= h) and (h <= b):
        print('Это нормально')
    elif a > h:
        print('Недосып')
    else:
        print('Пересып')
except ValueError:
    print('вы ввели не целое число или символ')

'''
lexel 3

1) Написать простой калькулятор, который считывает с пользовательского ввода три строки:
первое число, второе число и операцию, после чего применяет операцию к введенным числам
(“первое число” “операция” “второе число”) и выводит результат на экран.
Поддерживаемые операции: +, -, /, *, mod, pow, div, где:
mod - это взятие остатка от деления,
pow - возведение в степень,
div - целочисленное деление.
2) даны 2 числа a и b. Определить, делится ли a на b нацело. Делится ли b на a?
3) дано трёхзначное число. Определить, есть ли среди его цифр одинаковые
'''

try:
    a = int(input('введите целое число: '))
    b = int(input('введите целое число: '))
    c = input('введите знак')
    if c == '+':
        print(a+b)
    if c == '-':
        print(a-b)
    if c == '/':
        print(a/b)
    if c == '*':
        print(a*b)
    if c == 'mod':
        print(a%b)
    if c == 'pow':
        print(a**b)
    if c == 'div':
        print(a//b)
except ValueError:
    print('вы ввели не целое число или символ')

try:
    a = int(input('введите целое число: '))
    b = int(input('введите целое число: '))
    if (a%b==0):
        print('a делится нацело на b')
    if (b%a==0):
        print('b делится нацело на a')
except ValueError:
    print('вы ввели не целое число или символ')

try:
    a = int(input('введите трехзначное число'))
    c1 = a // 100
    c2 = (a // 10) - (c1*10)
    c3 = a % 10
    if c1==c2 or c2==c3 or c1==c3:
        print('есть одинаковые цифры')
    else:
        print('одинаковых цифр нет')
except ValueError:
    print('вы ввели не целое число или символ')
